In [1]:
from randomuser import RandomUser
import pandas as pd
import sqlite3
import prettytable

In [2]:
# create a list of X random users
r=RandomUser()
random_users=r.generate_users(100) # set users you want to generate. 5 in this case.
users_data = []
for id, user in enumerate(random_users,start=1):
	user_data=tuple([id,user.get_first_name(), user.get_last_name(), user.get_email(), user.get_city(), user.get_country()])
	users_data.append(user_data)

In [3]:
conn = sqlite3.connect('mydatabase.db')
cursor = conn.cursor()

In [4]:
# Drop the table if already exists.
cursor.execute("DROP TABLE IF EXISTS USERS")

# Creating table
table = " create table IF NOT EXISTS USERS(ID INTEGER PRIMARY KEY NOT NULL, FNAME VARCHAR(20), LNAME VARCHAR(20), EMAIL VARCHAR(30), CITY VARCHAR(20), COUNTRY VARCHAR(20));"
cursor.execute(table)
print("Table is Ready")

Table is Ready

In [5]:
# Inserting all the data at once with executemany()
cursor.executemany("insert into USERS values (?,?,?,?,?,?)", users_data)

In [6]:
# Save (commit) the changes at the database
conn.commit()

In [7]:
select_all = "SELECT * FROM USERS LIMIT 5"
cursor.execute(select_all)
all_data=cursor.fetchall()
#few_data=cursor.fetchmany(2) ##for fetching idicate number of rows
for row in all_data:
	print(row)

(1, 'Cindy', 'Terry', 'cindy.terry@example.com', 'Rockhampton', 'Australia')
(2, 'Kamile', 'Myre', 'kamile.myre@example.com', 'Ålvik', 'Norway')
(3, 'Niklas', 'Kivela', 'niklas.kivela@example.com', 'Tammela', 'Finland')
(4, 'Saana', 'Kivi', 'saana.kivi@example.com', 'Multia', 'Finland')
(5, 'Phoebe', 'Castillo', 'phoebe.castillo@example.com', 'Bristol', 'United Kingdom')

In [8]:
select_name= "SELECT FNAME FROM USERS"
cursor.execute(select_name)
f_names=cursor.fetchmany(2)
for name in f_names:
	print(name)

('Cindy',)
('Kamile',)

In [9]:
#Function to update user name by id
def update_user_name(new_name,id):
	cursor.execute('SELECT FNAME FROM USERS WHERE ID=?',(id,))
	old_name=cursor.fetchone()[0]
	cursor.execute('UPDATE USERS SET FNAME=? WHERE ID=?',(new_name, id))
	cursor.execute('SELECT * FROM USERS WHERE ID=?',(id,))
	row_updated=cursor.fetchone()
	print(f"User name updated from {old_name} to {new_name} successfully")
	print(row_updated)
	return conn.commit()

In [10]:
update_user_name('Selim',2)

User name updated from Kamile to Selim successfully
(2, 'Selim', 'Myre', 'kamile.myre@example.com', 'Ålvik', 'Norway')

In [11]:
cursor.close()
conn.close()

In [12]:
#connect to the database using sql magic
%load_ext sql
%sql sqlite:///mydatabase.db

In [13]:
prettytable.DEFAULT = 'DEFAULT'

In [14]:
%%sql
DROP TABLE IF EXISTS INTERNATIONAL_STUDENT_TEST_SCORES;

CREATE TABLE INTERNATIONAL_STUDENT_TEST_SCORES (
	country VARCHAR(50),
	first_name VARCHAR(50),
	last_name VARCHAR(50),
	test_score INT
);

INSERT INTO INTERNATIONAL_STUDENT_TEST_SCORES (country, first_name, last_name, test_score)
VALUES
('United States', 'Marshall', 'Bernadot', 54),
('Ghana', 'Celinda', 'Malkin', 51),
('Ukraine', 'Guillermo', 'Furze', 53),
('Greece', 'Aharon', 'Tunnow', 48),
('Russia', 'Bail', 'Goodwin', 46),
('Poland', 'Cole', 'Winteringham', 49),
('Sweden', 'Emlyn', 'Erricker', 55),
('Russia', 'Cathee', 'Sivewright', 49),
('China', 'Barny', 'Ingerson', 57),
('Uganda', 'Sharla', 'Papaccio', 55),
('China', 'Stella', 'Youens', 51),
('Poland', 'Julio', 'Buesden', 48),
('United States', 'Tiffie', 'Cosely', 58),
('Poland', 'Auroora', 'Stiffell', 45),
('China', 'Clarita', 'Huet', 52),
('Poland', 'Shannon', 'Goulden', 45),
('Philippines', 'Emylee', 'Privost', 50),
('France', 'Madelina', 'Burk', 49),
('China', 'Saunderson', 'Root', 58),
('Indonesia', 'Bo', 'Waring', 55),
('China', 'Hollis', 'Domotor', 45),
('Russia', 'Robbie', 'Collip', 46),
('Philippines', 'Davon', 'Donisi', 46),
('China', 'Cristabel', 'Radeliffe', 48),
('China', 'Wallis', 'Bartleet', 58),
('Moldova', 'Arleen', 'Stailey', 38),
('Ireland', 'Mendel', 'Grumble', 58),
('China', 'Sallyann', 'Exley', 51),
('Mexico', 'Kain', 'Swaite', 46),
('Indonesia', 'Alonso', 'Bulteel', 45),
('Armenia', 'Anatol', 'Tankus', 51),
('Indonesia', 'Coralyn', 'Dawkins', 48),
('China', 'Deanne', 'Edwinson', 45),
('China', 'Georgiana', 'Epple', 51),
('Portugal', 'Bartlet', 'Breese', 56),
('Azerbaijan', 'Idalina', 'Lukash', 50),
('France', 'Livvie', 'Flory', 54),
('Malaysia', 'Nonie', 'Borit', 48),
('Indonesia', 'Clio', 'Mugg', 47),
('Brazil', 'Westley', 'Measor', 48),
('Philippines', 'Katrinka', 'Sibbert', 51),
('Poland', 'Valentia', 'Mounch', 50),
('Norway', 'Sheilah', 'Hedditch', 53),
('Papua New Guinea', 'Itch', 'Jubb', 50),
('Latvia', 'Stesha', 'Garnson', 53),
('Canada', 'Cristionna', 'Wadmore', 46),
('China', 'Lianna', 'Gatward', 43),
('Guatemala', 'Tanney', 'Vials', 48),
('France', 'Alma', 'Zavittieri', 44),
('China', 'Alvira', 'Tamas', 50),
('United States', 'Shanon', 'Peres', 45),
('Sweden', 'Maisey', 'Lynas', 53),
('Indonesia', 'Kip', 'Hothersall', 46),
('China', 'Cash', 'Landis', 48),
('Panama', 'Kennith', 'Digance', 45),
('China', 'Ulberto', 'Riggeard', 48),
('Switzerland', 'Judy', 'Gilligan', 49),
('Philippines', 'Tod', 'Trevaskus', 52),
('Brazil', 'Herold', 'Heggs', 44),
('Latvia', 'Verney', 'Note', 50),
('Poland', 'Temp', 'Ribey', 50),
('China', 'Conroy', 'Egdal', 48),
('Japan', 'Gabie', 'Alessandone', 47),
('Ukraine', 'Devlen', 'Chaperlin', 54),
('France', 'Babbette', 'Turner', 51),
('Czech Republic', 'Virgil', 'Scotney', 52),
('Tajikistan', 'Zorina', 'Bedow', 49),
('China', 'Aidan', 'Rudeyeard', 50),
('Ireland', 'Saunder', 'MacLice', 48),
('France', 'Waly', 'Brunstan', 53),
('China', 'Gisele', 'Enns', 52),
('Peru', 'Mina', 'Winchester', 48),
('Japan', 'Torie', 'MacShirrie', 50),
('Russia', 'Benjamen', 'Kenford', 51),
('China', 'Etan', 'Burn', 53),
('Russia', 'Merralee', 'Chaperlin', 38),
('Indonesia', 'Lanny', 'Malam', 49),
('Canada', 'Wilhelm', 'Deeprose', 54),
('Czech Republic', 'Lari', 'Hillhouse', 48),
('China', 'Ossie', 'Woodley', 52),
('Macedonia', 'April', 'Tyer', 50),
('Vietnam', 'Madelon', 'Dansey', 53),
('Ukraine', 'Korella', 'McNamee', 52),
('Jamaica', 'Linnea', 'Cannam', 43),
('China', 'Mart', 'Coling', 52),
('Indonesia', 'Marna', 'Causbey', 47),
('China', 'Berni', 'Daintier', 55),
('Poland', 'Cynthia', 'Hassell', 49),
('Canada', 'Carma', 'Schule', 49),
('Indonesia', 'Malia', 'Blight', 48),
('China', 'Paulo', 'Seivertsen', 47),
('Niger', 'Kaylee', 'Hearley', 54),
('Japan', 'Maure', 'Jandak', 46),
('Argentina', 'Foss', 'Feavers', 45),
('Venezuela', 'Ron', 'Leggitt', 60),
('Russia', 'Flint', 'Gokes', 40),
('China', 'Linet', 'Conelly', 52),
('Philippines', 'Nikolas', 'Birtwell', 57),
('Australia', 'Eduard', 'Leipelt', 53)

 * sqlite:///mydatabase.db
Done.
Done.
99 rows affected.

[]

In [15]:
%%sql
SELECT *FROM INTERNATIONAL_STUDENT_TEST_SCORES LIMIT 5;

 * sqlite:///mydatabase.db
Done.

[('United States', 'Marshall', 'Bernadot', 54),
 ('Ghana', 'Celinda', 'Malkin', 51),
 ('Ukraine', 'Guillermo', 'Furze', 53),
 ('Greece', 'Aharon', 'Tunnow', 48),
 ('Russia', 'Bail', 'Goodwin', 46)]

In [16]:
country='Sweden'
%sql SELECT * FROM INTERNATIONAL_STUDENT_TEST_SCORES WHERE country=:country AND test_score > 50;

 * sqlite:///mydatabase.db
Done.

[('Sweden', 'Emlyn', 'Erricker', 55), ('Sweden', 'Maisey', 'Lynas', 53)]

In [19]:
%sql sqlite:///northwind.db

In [ ]:
%%sql 
SELECT * FROM customers LIMIT 5;
# SELECT * FROM categories LIMIT 5;
# SELECT * FROM suppliers LIMIT 5;
# SELECT * FROM orders LIMIT 5;
# SELECT * FROM orderdetails LIMIT 5;
# SELECT * FROM employees LIMIT 5;
# SELECT * FROM shippers LIMIT 5;
# SELECT * FROM products LIMIT 5;

   sqlite:///mydatabase.db
 * sqlite:///northwind.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21.35)]